In [338]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import matplotlib_inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score
import pickle

In [339]:
df1 = pd.read_csv(r"C:\Users\shrey\Desktop/realestate.csv")
df1.head()

,City,Price,Area,Location,bhk,Resale,MaintenanceStaff,Gymnasium,SwimmingPool,LandscapedGardens,JoggingTrack,Intercom,ClubHouse,24X7Security,CarParking,WashingMachine,Gasconnection,LiftAvailable
0,Bangalore,30000000.0,3340.0,Bangalore JP Nagar Phase 1,4.0,0.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,0.0,0.0,0.0,1.0
1,Bangalore,7888000.0,1045.0,Bangalore Dasarahalli on Tumkur Road,2.0,0.0,0.0,1.0,1.0,1.0,1.0,0.0,1.0,1.0,1.0,0.0,0.0,1.0
2,Bangalore,4866000.0,1179.0,Bangalore Kannur on Thanisandra Main Road,2.0,0.0,0.0,1.0,1.0,1.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,1.0
3,Bangalore,8358000.0,1675.0,Bangalore Doddanekundi,3.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0
4,Bangalore,6845000.0,1670.0,Bangalore Kengeri,3.0,0.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,0.0,0.0,1.0

In [340]:
df1.shape

(18740, 18)

In [341]:
for column in df1.columns:
    print(df1[column].value_counts())
    print("*"*20)

Bangalore    6207
Chennai      5014
Delhi        4998
Hyderabad    2518
Name: City, dtype: int64
********************
4000000.0     186
3500000.0     181
4500000.0     180
2500000.0     141
11000000.0    138
             ...
5822000.0       1
4720000.0       1
8302000.0       1
8634000.0       1
7750000.0       1
Name: Price, Length: 3999, dtype: int64
********************
800.0     596
1000.0    557
1800.0    302
1200.0    277
1500.0    271
         ...
2508.0      1
1734.0      1
2483.0      1
2324.0      1
2175.0      1
Name: Area, Length: 2111, dtype: int64
********************
Delhi Noida                          761
Delhi Uttam Nagar                    430
Delhi Dwarka Mor                     347
Delhi Vasant Kunj                    263
Bangalore Electronic City Phase 2    232
                                    ...
Chennai GST Road                       1
Chennai 200 Feet Radial Road           1
Delhi 59 Sector 22 Road                1
Delhi CD Block Dakshini Pitampura      1
Hyderabad Paradise Circle              1
Name: Location, Length: 1069, dtype: int64
********************
2.0    8435
3.0    7996
4.0    1247
1.0     896
5.0     132
6.0      17
7.0       7
8.0       7
Name: bhk, dtype: int64
********************
0.0    13189
1.0     5548
Name: Resale, dtype: int64
********************
9.0    10117
0.0     7913
1.0      707
Name: MaintenanceStaff, dtype: int64
********************
9.0    10117
1.0     4410
0.0     4210
Name: Gymnasium, dtype: int64
********************
9.0    10117
0.0     4991
1.0     3629
Name: SwimmingPool, dtype: int64
********************
9.0    10117
0.0     5685
1.0     2935
Name: LandscapedGardens, dtype: int64
********************
9.0    10117
0.0     5819
1.0     2801
Name: JoggingTrack, dtype: int64
********************
9.0    10117
0.0     4606
1.0     4014
Name: Intercom, dtype: int64
********************
9.0    10117
0.0     5036
1.0     3584
Name: ClubHouse, dtype: int64
********************
9.0    10117
0.0     5417
1.0     3203
Name: 24X7Security, dtype: int64
********************
9.0    10117
0.0     5260
1.0     3360
Name: CarParking, dtype: int64
********************
9.0    10117
0.0     8219
1.0      401
Name: WashingMachine, dtype: int64
********************
9.0    10117
0.0     7047
1.0     1573
Name: Gasconnection, dtype: int64
********************
9.0    10117
1.0     6030
0.0     2590
Name: LiftAvailable, dtype: int64
********************

In [342]:
df1.isnull().sum()

City                 3
Price                3
Area                 3
Location             3
bhk                  3
Resale               3
MaintenanceStaff     3
Gymnasium            3
SwimmingPool         3
LandscapedGardens    3
JoggingTrack         3
Intercom             3
ClubHouse            3
24X7Security         3
CarParking           3
WashingMachine       3
Gasconnection        3
LiftAvailable        3
dtype: int64

In [343]:
df2 = df1.dropna()
df2.isnull().sum()

City                 0
Price                0
Area                 0
Location             0
bhk                  0
Resale               0
MaintenanceStaff     0
Gymnasium            0
SwimmingPool         0
LandscapedGardens    0
JoggingTrack         0
Intercom             0
ClubHouse            0
24X7Security         0
CarParking           0
WashingMachine       0
Gasconnection        0
LiftAvailable        0
dtype: int64

In [344]:
df2 = df1.drop(['LandscapedGardens','JoggingTrack','SwimmingPool','Resale','Gasconnection','CarParking','LiftAvailable','MaintenanceStaff','Gymnasium','Intercom','ClubHouse','24X7Security','WashingMachine'],axis='columns')
df2.head()

,City,Price,Area,Location,bhk
0,Bangalore,30000000.0,3340.0,Bangalore JP Nagar Phase 1,4.0
1,Bangalore,7888000.0,1045.0,Bangalore Dasarahalli on Tumkur Road,2.0
2,Bangalore,4866000.0,1179.0,Bangalore Kannur on Thanisandra Main Road,2.0
3,Bangalore,8358000.0,1675.0,Bangalore Doddanekundi,3.0
4,Bangalore,6845000.0,1670.0,Bangalore Kengeri,3.0

In [345]:
df2.describe()

              Price          Area           bhk
count  1.873700e+04  18737.000000  18737.000000
mean   1.140007e+07   1397.229172      2.540908
std    2.608179e+07    791.821573      0.740903
min    2.000000e+06    200.000000      1.000000
25%    4.152000e+06    943.000000      2.000000
50%    6.600000e+06   1210.000000      3.000000
75%    1.130000e+07   1630.000000      3.000000
max    8.546000e+08  16000.000000      8.000000

In [346]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18740 entries, 0 to 18739
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   City      18737 non-null  object
 1   Price     18737 non-null  float64
 2   Area      18737 non-null  float64
 3   Location  18737 non-null  object
 4   bhk       18737 non-null  float64
dtypes: float64(3), object(2)
memory usage: 732.2+ KB

In [347]:
df2['Location'].value_counts()

Delhi Noida                          761
Delhi Uttam Nagar                    430
Delhi Dwarka Mor                     347
Delhi Vasant Kunj                    263
Bangalore Electronic City Phase 2    232
                                    ...
Chennai GST Road                       1
Chennai 200 Feet Radial Road           1
Delhi 59 Sector 22 Road                1
Delhi CD Block Dakshini Pitampura      1
Hyderabad Paradise Circle              1
Name: Location, Length: 1069, dtype: int64

In [348]:
df2['Location']=df2['Location'].fillna('Delhi Noida')

In [349]:
df2['bhk'].value_counts()

2.0    8435
3.0    7996
4.0    1247
1.0     896
5.0     132
6.0      17
7.0       7
8.0       7
Name: bhk, dtype: int64

In [350]:
df2.head()

,City,Price,Area,Location,bhk
0,Bangalore,30000000.0,3340.0,Bangalore JP Nagar Phase 1,4.0
1,Bangalore,7888000.0,1045.0,Bangalore Dasarahalli on Tumkur Road,2.0
2,Bangalore,4866000.0,1179.0,Bangalore Kannur on Thanisandra Main Road,2.0
3,Bangalore,8358000.0,1675.0,Bangalore Doddanekundi,3.0
4,Bangalore,6845000.0,1670.0,Bangalore Kengeri,3.0

In [351]:
df2['Price_per_sqft']=df2['Price']*100000/df1['Area']

In [352]:
df2['Price_per_sqft']

0        8.982036e+08
1        7.548325e+08
2        4.127226e+08
3        4.989851e+08
4        4.098802e+08
             ...
18735    7.534247e+08
18736    1.978691e+09
18737    5.066667e+08
18738    5.268293e+08
18739    5.761773e+08
Name: Price_per_sqft, Length: 18740, dtype: float64

In [353]:
df2.describe()

              Price          Area           bhk  Price_per_sqft
count  1.873700e+04  18737.000000  18737.000000    1.873700e+04
mean   1.140007e+07   1397.229172      2.540908    8.103186e+08
std    2.608179e+07    791.821573      0.740903    1.881117e+09
min    2.000000e+06    200.000000      1.000000    2.757100e+07
25%    4.152000e+06    943.000000      2.000000    4.049412e+08
50%    6.600000e+06   1210.000000      3.000000    5.410588e+08
75%    1.130000e+07   1630.000000      3.000000    7.730038e+08
max    8.546000e+08  16000.000000      8.000000    1.076444e+11

In [354]:
df2['Location'].value_counts()

Delhi Noida                          764
Delhi Uttam Nagar                    430
Delhi Dwarka Mor                     347
Delhi Vasant Kunj                    263
Bangalore Electronic City Phase 2    232
                                    ...
Bangalore Sompura                      1
Delhi 75 Noida Road                    1
Delhi 75 Sector 22 Road                1
Delhi Sector 108                       1
Hyderabad Paradise Circle              1
Name: Location, Length: 1069, dtype: int64

In [355]:
df2['Location'] = df2['Location'].apply(lambda x:x.strip())
Location_counts = df2['Location'].value_counts()

In [356]:
Location_counts

Delhi Noida                          764
Delhi Uttam Nagar                    430
Delhi Dwarka Mor                     347
Delhi Vasant Kunj                    263
Bangalore Electronic City Phase 2    232
                                    ...
Bangalore Sompura                      1
Delhi 75 Noida Road                    1
Delhi 75 Sector 22 Road                1
Delhi Sector 108                       1
Hyderabad Paradise Circle              1
Name: Location, Length: 1069, dtype: int64

In [357]:
Location_counts_less_10=Location_counts[Location_counts<=10]
Location_counts_less_10

Delhi Kundli                 10
Chennai Thaiyur              10
Bangalore Whitefield         10
Chennai Periyapanicheri      10
Chennai Vanagaram            10
                             ..
Bangalore Sompura             1
Delhi 75 Noida Road           1
Delhi 75 Sector 22 Road       1
Delhi Sector 108              1
Hyderabad Paradise Circle     1
Name: Location, Length: 744, dtype: int64

In [358]:
df2['Location'] = df2['Location'].apply(lambda x: 'other' if x in Location_counts_less_10 else x)

In [359]:
df2['Location'].value_counts()

other                          1924
Delhi Noida                     764
Delhi Uttam Nagar               430
Delhi Dwarka Mor                347
Delhi Vasant Kunj               263
                               ...
Chennai Kotturpuram              11
Bangalore KPC Layout             11
Hyderabad Darga Khaliz Khan      11
Bangalore Uttarahalli Hobli      11
Delhi Sector 17 Dwarka           11
Name: Location, Length: 326, dtype: int64

In [360]:
df2.describe()

              Price          Area           bhk  Price_per_sqft
count  1.873700e+04  18737.000000  18737.000000    1.873700e+04
mean   1.140007e+07   1397.229172      2.540908    8.103186e+08
std    2.608179e+07    791.821573      0.740903    1.881117e+09
min    2.000000e+06    200.000000      1.000000    2.757100e+07
25%    4.152000e+06    943.000000      2.000000    4.049412e+08
50%    6.600000e+06   1210.000000      3.000000    5.410588e+08
75%    1.130000e+07   1630.000000      3.000000    7.730038e+08
max    8.546000e+08  16000.000000      8.000000    1.076444e+11

In [361]:
(df2['Area']/df2['bhk']).describe()

count    18737.000000
mean       542.053630
std        218.407549
min        200.000000
25%        433.333333
50%        525.000000
75%        608.000000
max      16000.000000
dtype: float64

In [362]:
df3= df2[((df2['Area']/df2['bhk']) >= 300)]
df3.describe()

              Price          Area           bhk  Price_per_sqft
count  1.792300e+04  17923.000000  17923.000000    1.792300e+04
mean   1.157889e+07   1430.937287      2.541037    7.865983e+08
std    2.610660e+07    792.506652      0.747595    1.529144e+09
min    2.000000e+06    300.000000      1.000000    2.757100e+07
25%    4.300000e+06    995.000000      2.000000    4.000000e+08
50%    6.800000e+06   1240.000000      3.000000    5.422460e+08
75%    1.150000e+07   1650.000000      3.000000    7.751938e+08
max    8.546000e+08  16000.000000      8.000000    6.159615e+10

In [363]:
df3.shape

(17923, 6)

In [364]:
df3.Price_per_sqft.describe()

count    1.792300e+04
mean     7.865983e+08
std      1.529144e+09
min      2.757100e+07
25%      4.000000e+08
50%      5.422460e+08
75%      7.751938e+08
max      6.159615e+10
Name: Price_per_sqft, dtype: float64

In [365]:
def removeOutliners(df):
  df_Out = pd.DataFrame()
  for key,subdf in df.groupby('Location'):
    m = np.mean(subdf.Price_per_sqft)
    st = np.std(subdf.Price_per_sqft)
    reduced = subdf[(subdf.Price_per_sqft>(m-st)) & (subdf.Price_per_sqft<=(m+st))]
    df_Out = pd.concat([df_Out,reduced],ignore_index=True)
  return df_Out
df4 = removeOutliners(df3)
df4.shape

(15690, 6)

In [366]:
df4.describe()

              Price          Area           bhk  Price_per_sqft
count  1.569000e+04  15690.000000  15690.000000    1.569000e+04
mean   9.151071e+06   1400.075462      2.530911    6.314199e+08
std    9.707452e+06    726.086782      0.730299    4.182580e+08
min    2.000000e+06    300.000000      1.000000    2.757100e+07
25%    4.240000e+06    988.000000      2.000000    4.052040e+08
50%    6.534000e+06   1230.000000      2.000000    5.319420e+08
75%    1.070000e+07   1629.000000      3.000000    7.227625e+08
max    2.854000e+08  16000.000000      8.000000    1.142857e+10

In [367]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('Location'):
        bhk_stats= {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk]= {
                'mean': np.mean(bhk_df.Price_per_sqft),
                'std': np.std(bhk_df.Price_per_sqft),
                'count':bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices =np.append(exclude_indices, bhk_df[bhk_df.Price_per_sqft<(stats['mean'])].index.values)            
    return df.drop(exclude_indices, axis='index')

In [368]:
df4=bhk_outlier_remover(df4)

In [369]:
df4

            City       Price    Area             Location  bhk  Price_per_sqft
0      Bangalore   6700000.0  1180.0  Bangalore 5th Phase  2.0    5.677966e+08
1      Bangalore   5800000.0  1185.0  Bangalore 5th Phase  2.0    4.894515e+08
3      Bangalore   8400000.0  1180.0  Bangalore 5th Phase  2.0    7.118644e+08
4      Bangalore   4876000.0  1185.0  Bangalore 5th Phase  2.0    4.114768e+08
6      Bangalore   7498999.0  1180.0  Bangalore 5th Phase  2.0    6.355084e+08
...          ...         ...     ...                  ...  ...             ...
15652  Hyderabad  29500000.0  3883.0                other  4.0    7.597219e+08
15656  Hyderabad  14000000.0  1616.0                other  3.0    8.663366e+08
15667  Hyderabad  19500000.0  2500.0                other  4.0    7.800000e+08
15678  Hyderabad  22000000.0  1450.0                other  3.0    1.517241e+09
15680  Hyderabad  15500000.0  1080.0                other  2.0    1.435185e+09

[9956 rows x 6 columns]

In [370]:
df4.shape

(9956, 6)

In [371]:
df4.drop(columns=['Price_per_sqft'], inplace=True)

In [372]:
df4.to_csv("Cleaned_data.csv")

In [373]:
X=df4.drop(columns=['Price'])
y=df4['Price']

In [374]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression, Lasso, Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [375]:
X_train, X_test, y_train, y_test= train_test_split(X,y, test_size=0.2, random_state=0)

In [376]:
print(X_train.shape)
print(X_test.shape)

(7964, 4)
(1992, 4)

In [377]:
column_trans =make_column_transformer((OneHotEncoder(sparse=False), ['Location','City']), remainder='passthrough')

In [378]:
scaler = StandardScaler()
lr = LinearRegression(normalize=True)
pipe =make_pipeline(column_trans, scaler, lr)
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['Location', 'City'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [379]:
y_pred_lr = pipe.predict(X_test)
r2_score(y_test, y_pred_lr)

0.6847875534446977

In [380]:
lasso= Lasso()
pipe = make_pipeline(column_trans, scaler, lasso)
pipe.fit(X_train, y_train)

y_pred_lasso = pipe.predict(X_test)
r2_score(y_test, y_pred_lasso)

0.6848289689588756

In [381]:
X.columns

Index(['City', 'Area', 'Location', 'bhk'], dtype='object')

In [382]:
def predict_price(City,Area,Location,bhk):    
    loc_index = np.where(X.columns==City)[0]

    x = np.zeros(len(X.columns))
    
    x[0] = Location
    x[1] = bhk
    
    if loc_index >= 0:
        x[loc_index] = 1

    return lr_clf.predict([x])[0]

In [383]:
pipe.predict(pd.DataFrame([['Bangalore',3340.0,'Bangalore JP Nagar Phase 1',4.0]], columns=['City','Area','Location','bhk']))

array([26562101.6253354])

In [385]:
pickle.dump(pipe,open('model.pkl','wb'))